{
  "basics": {
    "name": "Lucas Mezêncio",
    "label": "Software Engineer - Backend",
    "picture": "//secure.gravatar.com/avatar/9c0883cd34733c1fa9c66331904bdb40?s=420",
    "email": "eu@lucasmezencio.com",
    "summary": "I am an experienced Software Engineer, building software since 2008. I have experience developing and maintaining systems and web applications, solid knowledge of data modelling and Linux servers administration. Besides that I'm focused on quality code always praising good practices, ensuring application performance and scalability.\n\nLeading and mentoring not only new but experienced Engineers is one of my passions too, it's a place where we can share experiences and knowledge while we move towards the same goal, supporting them to grow professionally and also personally. \n\nI like (and I know) regular expressions and I am a Git and Free and Open Source Software enthusiastic, Certified ScrumMaster by Scrum Alliance, spreading the Agile Manifesto in software development and especially the interaction of individuals in the course of development, and that great software are built on top of great people.\n\nI love electronics and playing once in a while with my Arduino at home.\n\nI'm communicative, extroverted and friendly.",
    "location": {
      "city": "Lourinhã",
      "region": "Lisbon",
      "countryCode": "Portugal"
    },
    "phone": "+351 938 232 024",
    "website": "https://about.me/lucasmezencio",
    "profiles": [
      {
        "network": "linkedin",
        "username": "lucasmezencio",
        "url": "https://linkedin.com/in/lucasmezencio"
      },
      {
        "network": "github",
        "username": "lucasmezencio",
        "url": "https://github.com/lucasmezencio"
      },
      {
        "network": "facebook",
        "username": "lucasmezencio",
        "url": "https://fb.me/lucasmezencio"
      },
      {
        "network": "twitter",
        "username": "lucasmezencio",
        "url": "https://twitter.com/lucasmezencio"
      }
    ]
  },
  "work": [
    {
      "company": "ZOLAR GmBH",
      "url": "https://zolar.de/",
      "position": "Senior Software Engineer - Backend",
      "summary": "I've been working with my team to improve our workflow and deliver value to the business day-by-day, always challenging the team and keeping a healthy and relaxed work environment.\n\nI've managed to help my Tech Lead help the whole team to deliver our very first sprint, before that, all the committed work wasn't being delivered due to miscalculation of team velocity and capacity planning.",
      "startDate": "2023-09-01",
      "highlights": [
        "NodeJS",
        "TypeScript",
        "Amazon API Gateway",
        "Amazon DynamoDB",
        "Apache Kafka",
        "AWS CloudFormation",
        "AWS Lambda",
        "BitBucket CI",
        "DataDog",
        "Docker",
        "Git"
      ]
    },
    {
      "company": "Time2Play Media Ltd. (former KaFe.Rocks Ltd.)",
      "url": "https://time2play.com/corporate/",
      "position": "Lead Software Engineer - Backend",
      "summary": "I've been helping my team to achieve the best pace and excellence for software development while leading them to always aim for the company goals by balancing technical and product needs by supporting them to grow as individuals and as a team.\n\n Ensuring that the process run smoothly helping them with a clear definition of the Software Development Life Cycle (SDLC).\n\nI've been helping my team to achieve the best development practices, such as iterative and incremental releases, Unit Testing, E2E Testing, efficient refactoring, and SOLID principles.\n\nWe've created a stable and '1-click' Feature Environment (isolated test and QA environments) with Laravel Forge and Cloudflare Workers.",
      "startDate": "2021-10-13",
      "endDate": "2023-08-31",
      "highlights": [
        "PHP (Laravel 9)",
        "Gatsby Cloud",
        "ShellScript (Bash)",
        "Docker",
        "MySQL",
        "Git",
        "BitBucket CI",
        "GitHub Actions",
        "DevOps",
        "DigitalOcean",
        "CloudFlare"
      ]
    },
    {
      "company": "Blexr Ltd.",
      "url": "https://blexr.com/",
      "position": "Senior PHP Engineer",
      "summary": "I've helped my team to achieve the best Software Development practices, such as Unit Testing, efficient refactoring, and SOLID principles.\n\nTogether with another senior developer, we've created a stable and '1-click' development environment with Docker.\n\nI've planned, designed and executed the refactoring of a monolith into small and independent micro-services fully scalable and performant.\n\nWorked together with the DevOps team to create and set up pipelines for deployments, static code analysis and integration tests.\n\nManaged to improve up to 10x the response time of a web micro-service for redirects (from 800ms to 8ms).",
      "startDate": "2019-01-01",
      "endDate": "2021-10-09",
      "highlights": [
        "PHP (in-house framework, Symfony 5)",
        "ShellScript (Bash)",
        "Docker",
        "MySQL",
        "MariaDB",
        "Git",
        "GitLab CI",
        "DevOps",
        "AWS (SQS, RDS, Redshift, S3, ECS)",
        "Redis",
        "Cloudflare (Workers)"
      ]
    },
    {
      "company": "XLabora Ltd. / BuddyAd",
      "url": "https://xlabora.com/",
      "position": "Senior Full Stack Web Engineer / Tech Lead",
      "summary": "I've created an action-based access log system in the application. I optimised resource utilisation and application runtime by deploying a queuing system using Beanstalkd, later migrated to Amazon SQS.\n\nImproved database organisation and modelling, along with query optimisation, significantly increasing application performance, also migrating the database to Amazon RDS.\n\nI rewrote a good part of the application using clean code practices and software architecture to ensure a quick and performative application for the end user.\n\nReduced infrastructure costs by nearly 60% after optimisations.",
      "startDate": "2017-04-01",
      "endDate": "2018-10-01",
      "highlights": [
        "PHP",
        "ShellScript (Bash)",
        "Laravel 5",
        "Symfony 4",
        "Doctrine",
        "Docker",
        "MySQL",
        "MariaDB",
        "Git",
        "AWS (RDS, EC2, SQS, Elastic Beanstalk)"
      ]
    },
    {
      "company": "Its4Company",
      "position": "Senior Full Stack Web Engineer",
      "summary": "I worked on the restructuring of the application used at the time, improving the coherence between the architecture and the organisation of the code. I created an interactive drawing application using JavaScript and canvas.",
      "startDate": "2016-12-01",
      "endDate": "2017-03-01",
      "highlights": [
        "AngularJS",
        "NodeJS",
        "Git"
      ]
    },
    {
      "company": "PRODEMGE (Companhia de Tecnologia da Informação do Estado de Minas Gerais)",
      "url": "https://prodemge.mg.gov.br/",
      "position": "Senior Developer",
      "summary": "I worked with system analysts to help design features and tasks for the development team, always ensuring fast, concise deliveries.\n\nI created a connection driver for CakePHP 3 to connect to Db2 for IBM z / OS banks, and I also collaborated with the Laravel Db2 project by adding the Db2 for IBM z / OS connection functionality.\n\nI also worked with the infrastructure team to develop a code version control flow and Git deployment, and to optimise automated deploy routines with Jenkins.",
      "startDate": "2016-03-01",
      "endDate": "2016-12-01",
      "highlights": [
        "PHP",
        "CakePHP 2/3",
        "Laravel 5",
        "Apache",
        "Git",
        "Oracle",
        "Db2 for IBM z/OS"
      ]
    },
    {
      "company": "Fundep / UFMG - Universidade Federal de Minas Gerais",
      "url": "https://ufmg.br/",
      "position": "Senior Full Stack Web Developer",
      "summary": "I worked on the maintenance and development of new features, optimisation and refactoring of legacy code. I rewrote the entire back-office application from scratch using a completely new and more concise architecture.\n\nI optimised the Continuous Integration process and deploy the application together with the infrastructure team.",
      "startDate": "2015-08-01",
      "endDate": "2016-02-01",
      "highlights": [
        "PHP",
        "ShellScript (Bash)",
        "Zend Framework 2",
        "Symfony 2",
        "Doctrine",
        "Vagrant",
        "AngularJS",
        "Apache",
        "MySQL",
        "Git",
        "Ubuntu"
      ]
    },
    {
      "company": "Méliuz",
      "url": "https://meliuz.com.br/",
      "position": "Software Engineer",
      "summary": "I created an access control system based on the routes of the application used in the back office. I also created a routine for backup of the production database in ShellScript.\n\nI collaborated with the team's involvement in migrating version control to Github and creating a more coherent internal communication culture among the team.",
      "startDate": "2014-08-01",
      "endDate": "2015-07-01",
      "highlights": [
        "PHP",
        "Python",
        "Laravel 4",
        "MySQL",
        "MongoDB",
        "Redis",
        "Flask",
        "Beanstalkd",
        "ShellScript (Bash)",
        "CentOS",
        "Amazon Linux",
        "Git"
      ]
    },
    {
      "company": "Learncafe - Cursos Online",
      "url": "https://learncafe.com/",
      "position": "System Analyst / Tech Lead / ScrumMaster",
      "summary": "As a ScrumMaster and analyst, I organised the flow of development, increasing the team's productivity and thus ensuring more assertive, concise and fast deliveries.\n\nI helped organise the entire legacy code, refactoring whenever possible using clean code techniques and software architecture. I also created a deployment flow for the Gitflow-based application. I also created the initial setup of the production servers, such as making better use of the machine resources to run the application.",
      "startDate": "2013-11-01",
      "endDate": "2014-08-01",
      "highlights": [
        "PHP",
        "Zend Framework",
        "MySQL",
        "SOLR",
        "Git"
      ]
    },
    {
      "company": "JCHEBLY Comunicação e Mídia",
      "url": "https://jchebly.com.br/",
      "position": "Developer and Analyst",
      "summary": "I worked in the analysis and development of web applications focusing always on the best practices of software development, using cutting-edge technologies, always compatible with the needs of the clients.\n\nIn the part of project planning and management, I increased the productivity of the team by organising the flow of project development, applying project management methodologies and helping to build a fully qualified team.\n\nConfiguration and administration of Linux servers.",
      "startDate": "2012-09-01",
      "endDate": "2013-10-01",
      "highlights": [
        "PHP",
        "Symfony 2",
        "MySQL",
        "Doctrine",
        "NodeJS",
        "ExpressJS",
        "MongoDB",
        "Redis",
        "Ubuntu",
        "CentOS",
        "Amazon Linux"
      ]
    },
    {
      "company": "Bolt Brasil Comunicação Digital",
      "position": "Developer and Analyst",
      "summary": "Analysis and development of systems web applications.\n\nConfiguration and administration of Linux servers.",
      "startDate": "2011-06-01",
      "endDate": "2012-09-01",
      "highlights": [
        "PHP",
        "Zend Framework",
        "Wordpress",
        "Doctrine 1",
        "MySQL",
        "Ubuntu"
      ]
    },
    {
      "company": "useInternational",
      "position": "Technology Information Developer",
      "summary": "Maintenance and development of new features, optimising and refactoring legacy code, helping to steady improvement project.",
      "startDate": "2010-11-01",
      "endDate": "2011-06-01",
      "highlights": [
        "PHP",
        "Zend Framework",
        "MySQL"
      ]
    },
    {
      "company": "Plan B Comunicação",
      "url": "https://planb.com.br/",
      "position": "Analista Desenvolvedor",
      "summary": "Analysis and development of systems web applications.\n\nAnalysis, planning and project management.",
      "startDate": "2010-09-01",
      "endDate": "2010-11-01",
      "highlights": [
        "PHP",
        "Codeigniter",
        "Wordpress",
        "MySQL",
        "SQL Server 2005",
        "ASP"
      ]
    },
    {
      "company": "Studio Sol Comunicação Digital",
      "url": "https://studiosol.com.br/",
      "position": "Desenvolvedor Web",
      "summary": "Analysis and development of systems web applications.\n\nConfiguration and administration of Linux servers.\n\nAnalysis, planning and project management.",
      "startDate": "2008-09-01",
      "endDate": "2010-07-01",
      "highlights": [
        "PHP",
        "Wordpress",
        "MySQL",
        "OpenSocial (orkut)",
        "Memcached"
      ]
    }
  ],
  "volunteer": [
    {
      "organisation": "PHP MG",
      "position": "Co-organiser",
      "summary": "I help in organising events and ensuring a harmless and pleasant environment for all types of people.",
      "highlights": [
        "beer.php - Informal Meetup that happens 1 time a month where we chat about programming and drink a beer (or soft drinks, or juice, or tea).",
        "PHPMG Talks - Formal Meetup with at least 2 talks on subjects involving the PHP ecosystem and Web Development widely."
      ],
      "startDate": "2015-01-01"
    }
  ],
  "education": [
    {
      "institution": "Instituto Superior de Tecnologias Avançadas - ISTEC",
      "area": "Computer Science",
      "studyType": "Master",
      "startDate": "2022-11",
      "courses": [
        "Computer Science - Cloud Computing"
      ],
      "concluded": false
    },
    {
      "institution": "Instituto Superior de Tecnologias Avançadas - ISTEC",
      "area": "Computer Science",
      "studyType": "Postgraduate",
      "startDate": "2021-09",
      "endDate": "2022-11",
      "courses": [
        "Virtualisation and Cloud Computing"
      ],
      "concluded": true
    },
    {
      "institution": "Universidade Estácio de Sá",
      "area": "Computer Science",
      "studyType": "Bachelor",
      "startDate": "2013-01",
      "endDate": "2015-01",
      "courses": [
        "Analysis and Systems Development"
      ],
      "concluded": false
    },
    {
      "institution": "Faculdade Pitágoras",
      "area": "Computing",
      "studyType": "Bachelor",
      "startDate": "2006-01",
      "endDate": "2010-01",
      "courses": [
        "Technology in Development of Systems for Internet and Databases"
      ],
      "concluded": false
    }
  ],
  "skills": [
    {
      "name": "PHP",
      "level": "15+ years"
    },
    {
      "name": "JavaScript",
      "level": "15+ years"
    },
    {
      "name": "MySQL",
      "level": "14+ years"
    },
    {
      "name": "TypeScript",
      "level": "2+ years"
    },
    {
      "name": "Linux",
      "level": "11+ years"
    },
    {
      "name": "Git",
      "level": "10+ years"
    },
    {
      "name": "Python",
      "level": "10+ years"
    },
    {
      "name": "DevOps",
      "level": "9+ years"
    },
    {
      "name": "Postgres",
      "level": "8+ years"
    },
    {
      "name": "Docker",
      "level": "8+ years"
    },
    {
      "name": "AWS",
      "level": "8+ years"
    },
    {
      "name": "Cloudflare",
      "level": "5+ years"
    }
  ],
  "languages": [
    {
      "name": "Portuguese",
      "level": "Native Speaker"
    },
    {
      "name": "English",
      "level": "Conversational"
    }
  ],
  "interests": [
    {
      "name": "Music"
    },
    {
      "name": "Videogames"
    },
    {
      "name": "Technology"
    },
    {
      "name": "Science"
    },
    {
      "name": "Astronomy"
    }
  ],
  "references": [
    {
      "name": "Kurt Paris (Experienced technical leader with a love for Building Effective Teams, Servant leadership, APIs, Strategic Thinking and Data/Observability)",
      "reference": "Lucas is, simply put, one of a kind. Despite being a highly skilled engineer - he is a genuinely nice person who will always go out of his way to make sure that the people in the team have everything they need to succeed. He is extremely honest, and is willing to step outside his comfort zone (in terms of process/technology etc) when the project requires it.\n\nI think Lucas would be a great addition to any teamLucas"
    },
    {
      "name": "Mex Emini (CTO @ SiGMA)",
      "reference": "I have had the privilege to work with Lucas at Blexr and KaFe Rocks, where he showed his leadership potential to lead and grow a team of developers. Lucas is skilled on back-end and front-end technologies combined with in-depth knowledge of DevOps. His maturity to handle team dysfunctions and ability to convey a message to stakeholders, make him an exceptional Lead Developer. I strongly recommend Lucas, and I am confident he will be a great addition to any organization."
    },
    {
      "name": "Damian Dąbrowski (Growth Engineer Leader @ Red Acre / CEO & Co-Founder @ GIT.WATCH)",
      "reference": "Lucas is a very calm person that even in hot moments keep calm and is looking for the best solution to get rid off troube. He's expertise with PHP was a huge plus for the project when we worked together! Lucas also keeps his code very clean and organized that helps to develop big projects without any worry that it will turn in wrong way at some point!"
    },
    {
      "name": "Dylan Grech (CTO / Founder @ Lifeboat)",
      "reference": "It's quite rare to find professionals as Lucas. He always strived for perfection and never backed out of a challenge. It was an absolute pleasure to work with someone so motivated and so passionate about his work."
    },
    {
      "name": "Jonathan Pereira (Software Engineer @ Zizoo Boats)",
      "reference": "I've had the opportunity to work with Lucas twice. At both opportunities, he was known to be a dedicated professional committed with the projects and deadlines. He was also known to be always available to help the colleagues to find solutions, debug codes or even have a usability discussion."
    },
    {
      "name": "Octavio Amuchástegui (Software Engineer @ Windranger Labs)",
      "reference": "Lucas is an excellent developer with great skills. We worked together in a lot of projects and always helped me. We always discuss a lot of technical solutions and was open to teach and explain his point of view. Work with Lucas was an excellent opportunity."
    },
    {
      "name": "Marcos Duarte (Director of Engineering @ Immutable)",
      "reference": "Lucas is an outstanding professional. From his interpersonal skills to the quality of the code he writes, you can easily see why he stands out from the crowd. During the time we worked together at Learncafe, he helped bring our tech team to a whole new level by introducing us to best practices and the newest technology, as well as implementing Agile Development, which significantly increased the team's productivity. As a former colleague and as a friend, I have Lucas as a point of reference, as I am constantly learning new things from him."
    },
    {
      "name": "José de Menezes Soares (Entrepreneur & Investor)",
      "reference": "Lucas Mezêncio é um profissional com real paixão por tecnologia. Sempre antenado, trata-se de um early adopter do que tem de mais moderno, produtivo e novo no mercado. A experiência de trabalhar com o Lucas Mezêncio no Learncafe foi muito importante para mim e para empresa, onde atualizamos muitos processos e tecnologias, tudo baseado nas experiência deste grande profissional!"
    },
    {
      "name": "Luiz Pedone (Lead Software Engineer @ Thread)",
      "reference": "Lucas is a very good developer. He cares about code quality, always advocating for clean code and readability. During the time we worked together at Méliuz, Lucas and I did several improvements on the development process. These improvements helped developers feel more involved in code review processes and more productive. Last but not least, Lucas is a great guy to have in a team: he's very collaborative and engaged in making the team better."
    },
    {
      "name": "Flávio Silva (Tech Lead @ Tagme Food Solutions)",
      "reference": "Tive a ótima oportunidade de trabalhar juntos na mesma empresa. Lucas é um profissional dedicado, possui uma visão crítica apurada, detalhista e trabalha muito bem em grupo. Possui realmente bastante talento com desenvolvimento PHP, JS e administração de servidores Linux."
    },
    {
      "name": "Marcello Cardoso (CTO @ Getrak)",
      "reference": "Lucas has a natural thirst for innovation, and is extremely pleasant to work in the same environment that him, as he is a really friendlyand easy-going person."
    }
  ]
}
